import os
 
path =( 
"F:\\trs\\music\\muz1\\dif\\02 - Track  2.wma",
"F:\\trs\\music\\muz1\\инструменталка+классика\\классика\\01 Тема любви (Музыка из к-ф 'Профессионал'_.wma",
"F:\\trs\\music\\muz1\\инструменталка+классика\\классика\\02 Шербурские зонтики.wma",
"F:\\trs\\music\\muz1\\инструменталка+классика\\классика\\03 Тема любви (Музыка из к-ф 'Крестный отец').wma",
"F:\\trs\\music\\muz1\\инструменталка+классика\\классика\\05 Полюби меня в танце.wma",
"F:\\trs\\music\\muz1\\инструменталка+классика\\классика\\06 Здесь была Лили.wma",
"F:\\trs\\music\\muz1\\инструменталка+классика\\классика\\07 Ветер плачь (Музыка из к-ф 'Профессионал').wma",
"F:\\trs\\music\\muz1\\инструменталка+классика\\классика\\07 Одинокий пастух.wma",
"F:\\trs\\music\\muz1\\инструменталка+классика\\классика\\09 Отель Калифорния.wma",
"F:\\trs\\music\\muz1\\инструменталка+классика\\классика\\09 Эммануэль.wma",
"F:\\trs\\music\\muz1\\инструменталка+классика\\классика\\11 Одинокий пастух.wma",
"F:\\trs\\music\\muz1\\инструменталка+классика\\классика\\13 Чувство.wma",
"F:\\trs\\music\\muz1\\инструменталка+классика\\классика\\14 Романс любви.wma",
"F:\\trs\\music\\muz1\\инструменталка+классика\\классика\\16 К Элизе.wma",
"F:\\trs\\music\\muz1\\инструменталка+классика\\классика\\17 Токката.wma",
"F:\\trs\\music\\Разобрал\\Сплин\\еще\\Сплин - Линия Жизни.wma",
"F:\\trs\\music\\Разобрал\\Сплин\\еще\\Сплин - Пой мне еще.wma",
"F:\\trs\\music\\Разобрал\\Сплин\\еще\\Сплин - Совсем другой.wma",
"F:\\trs\\music\\muz1\\инструменталка+классика\\классика\\06 Здесь была Лили.wma",
"F:\\trs\\music\\muz1\\инструменталка+классика\\классика\\07 Одинокий пастух.wma",
"F:\\trs\\music\\muz1\\инструменталка+классика\\классика\\05 Кафе на обочине.wma",
"F:\\trs\\music\\muz1\\инструменталка+классика\\классика\\06 Здесь была Лили.wma",
"F:\\trs\\music\\muz1\\инструменталка+классика\\классика\\05 Полюби меня в танце.wma",
"F:\\trs\\music\\muz1\\инструменталка+классика\\классика\\07 Одинокий пастух.wma",
"F:\\trs\\music\\muz1\\инструменталка+классика\\классика\\02 Концерт для гитары Родриго.wma",
"F:\\trs\\music\\muz1\\инструменталка+классика\\классика\\03 Тема любви (Музыка из к-ф 'Крестный отец').wma",
"F:\\trs\\music\\muz1\\инструменталка+классика\\классика\\21 Индийская жара.wma",
"F:\\trs\\music\\muz1\\инструменталка+классика\\классика\\04 Привет.wma",
"F:\\trs\\music\\Разобрал\\Сплин\\еще\\Сплин - Линия Жизни.wma"
)

print ('начали...')
k=0
l=[]
for i in path:
   if i.endswith('mp3') or i.endswith('wav') or i.endswith('MP3') or i.endswith('ogg') or i.endswith('Mp3') or i.endswith('wma'):
     if os.path.exists(i): ## проверка на существование файла, если он был удален ранее
        os.remove(i)
     k=k+1
     print ('del', i, '\r\n')
   else:
     l.append(i)

print ('закончили ', '\r\n')   
print ('обработано ', k, ' записей из ', len(path), '\r\n')
print ('оставшиеся файлы ', len(l))
for i in l:
    print (i)

