'''
Напишите функцию modify_list(l), которая принимает на вход список целых чисел,
удаляет из него все нечётные значения, а чётные нацело делит на два.
Функция не должна ничего возвращать, требуется только изменение переданного списка, например:
-------------------------------
lst = [1, 2, 3, 4, 5, 6]
print(modify_list(lst))  # None
print(lst)               # [1, 2, 3]
modify_list(lst)
print(lst)               # [1]

lst = [10, 5, 8, 3]
modify_list(lst)
print(lst)               # [5, 4]
Функция не должна осуществлять ввод/вывод информации.
-------------------------------

'''
##----------------------------------------------------------------------------------
def modify_list(l):
    x=0
    ll=len(l)
    while x<ll:
        a=l.pop(0)
        if a%2==0: l.append(a//2)
        x+=1
        
"""
def modify_list(l):
  l_n = [i//2 for i in l if i%2==0]
  l.clear()
  l += l_n
"""
lst = [1, 2, 3, 4, 5, 6]
print(modify_list(lst))  # None
print(lst)               # [1, 2, 3]
modify_list(lst)
print(lst)               # [1]

lst = [10, 5, 8, 3]
modify_list(lst)
print(lst)  

